
## ✅ Terraform Plan Succeeded

**Workflow**: [20510035298](https://github.com/wangzitian0/infra/actions/runs/20510035298)

<details>
<summary>📋 Plan Output</summary>

### 📦 platform

```terraform
19:41:23.883 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
19:41:26.452 STDOUT terraform: random_password.dashboard_oidc_client_secret[0]: Refreshing state... [id=none]
19:41:26.452 STDOUT terraform: random_id.kubero_session_secret: Refreshing state... [id=zeyCGHUvA37amm8E6hBavxw1k-T73Gv83nhjVj8AhKc]
19:41:26.452 STDOUT terraform: random_password.portal_cookie_secret[0]: Refreshing state... [id=none]
19:41:26.452 STDOUT terraform: random_password.portal_gate_client_secret[0]: Refreshing state... [id=none]
19:41:26.452 STDOUT terraform: terraform_data.domain_config_check: Refreshing state... [id=28e073ad-b9b0-a028-2f69-65fbcddfbbb1]
19:41:26.452 STDOUT terraform: terraform_data.portal_sso_precheck: Refreshing state... [id=a912d9c3-6b86-ef7f-b2b4-f4e56f422964]
19:41:26.452 STDOUT terraform: random_id.kubero_webhook_secret: Refreshing state... [id=dhHyw_8bNByDLHGDFFTJ8TbDQlIu-RYg9XSKtAo5dBI]
19:41:26.452 STDOUT terraform: terraform_data.health_check_target[0]: Refreshing state... [id=ff153b72-191c-4599-018f-65a742e9eb4d]
19:41:26.452 STDOUT terraform: random_password.vault_oidc_client_secret[0]: Refreshing state... [id=none]
19:41:26.453 STDOUT terraform: random_password.kubero_oidc_client_secret[0]: Refreshing state... [id=none]
19:41:26.455 STDOUT terraform: kubernetes_namespace.kubero_operator_system: Refreshing state... [id=kubero-operator-system]
19:41:26.455 STDOUT terraform: data.kubernetes_namespace.platform: Reading...
19:41:26.459 STDOUT terraform: kubernetes_namespace.observability: Refreshing state... [id=observability]
19:41:26.466 STDOUT terraform: vault_policy.vso_reader: Refreshing state... [id=vso-reader]
19:41:26.474 STDOUT terraform: vault_policy.admin[0]: Refreshing state... [id=admin]
19:41:26.475 STDOUT terraform: vault_identity_group.developer[0]: Refreshing state... [id=f7e4fa30-a522-c524-6927-6e0f8c21d4f3]
19:41:26.475 STDOUT terraform: vault_policy.kubero: Refreshing state... [id=kubero]
19:41:26.482 STDOUT terraform: vault_policy.developer[0]: Refreshing state... [id=developer]
19:41:26.483 STDOUT terraform: data.vault_kv_secret_v2.signoz_clickhouse: Reading...
19:41:26.483 STDOUT terraform: vault_auth_backend.kubernetes: Refreshing state... [id=kubernetes]
19:41:27.080 STDOUT terraform: data.kubernetes_namespace.platform: Read complete after 1s [id=platform]
19:41:27.081 STDOUT terraform: vault_identity_group.viewer[0]: Refreshing state... [id=89e06fbb-fc87-9471-ecc7-04b5747e4b06]
19:41:27.289 STDOUT terraform: vault_policy.default: Refreshing state... [id=default]
19:41:27.295 STDOUT terraform: vault_policy.viewer[0]: Refreshing state... [id=viewer]
19:41:27.790 STDOUT terraform: vault_identity_group.admin[0]: Refreshing state... [id=0ac3b38e-52bb-3a86-d72d-71ad31784ee3]
19:41:27.793 STDOUT terraform: data.cloudflare_zone.internal: Reading...
19:41:27.801 STDOUT terraform: data.kubernetes_secret.casdoor_builtin: Reading...
19:41:27.804 STDOUT terraform: helm_release.vault: Refreshing state... [id=vault]
19:41:27.809 STDOUT terraform: helm_release.kubernetes_dashboard: Refreshing state... [id=kubernetes-dashboard]
19:41:27.820 STDOUT terraform: data.vault_kv_secret_v2.signoz_clickhouse: Read complete after 2s [id=secret/data/signoz]
19:41:27.823 STDOUT terraform: kubernetes_service_account.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
19:41:27.823 STDOUT terraform: kubernetes_config_map.homer_config[0]: Refreshing state... [id=platform/homer-config]
19:41:27.823 STDOUT terraform: kubernetes_config_map.casdoor_init_data[0]: Refreshing state... [id=platform/casdoor-init-data]
19:41:27.826 STDOUT terraform: kubernetes_service.homer[0]: Refreshing state... [id=platform/homer]
19:41:27.837 STDOUT terraform: helm_release.signoz: Refreshing state... [id=signoz]
19:41:28.002 STDOUT terraform: kubectl_manifest.kubero_operator[3]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonpostgres.application.kubero.dev]
19:41:28.012 STDOUT terraform: data.kubernetes_secret.casdoor_builtin: Read complete after 0s [id=platform/casdoor-builtin-secret]
19:41:28.014 STDOUT terraform: kubectl_manifest.kubero_operator[17]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopostgresqls.application.kubero.dev]
19:41:28.101 STDOUT terraform: data.cloudflare_zone.internal: Read complete after 0s [id=6e69310ba4000e47c0a2480e2606713a]
19:41:28.103 STDOUT terraform: kubectl_manifest.kubero_operator[22]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system/roles/kubero-operator-leader-election-role]
19:41:28.273 STDOUT terraform: kubectl_manifest.kubero_operator[13]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomemcacheds.application.kubero.dev]
19:41:28.274 STDOUT terraform: kubectl_manifest.kubero_operator[4]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonrabbitmqs.application.kubero.dev]
19:41:28.281 STDOUT terraform: kubectl_manifest.kubero_operator[15]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomysqls.application.kubero.dev]
19:41:28.285 STDOUT terraform: kubectl_manifest.kubero_operator[14]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomongodbs.application.kubero.dev]
19:41:29.778 STDOUT terraform: kubectl_manifest.kubero_operator[9]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoelasticsearches.application.kubero.dev]
19:41:29.778 STDOUT terraform: kubectl_manifest.kubero_operator[5]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonredis.application.kubero.dev]
19:41:29.778 STDOUT terraform: kubectl_manifest.kubero_operator[10]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoes.application.kubero.dev]
19:41:29.829 STDOUT terraform: kubectl_manifest.kubero_operator[43]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-proxy-role]
19:41:29.927 STDOUT terraform: kubectl_manifest.kubero_operator[27]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-editor-role]
19:41:29.989 STDOUT terraform: kubectl_manifest.kubero_operator[11]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberokafkas.application.kubero.dev]
19:41:29.991 STDOUT terraform: kubectl_manifest.kubero_operator[18]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoprometheuses.application.kubero.dev]
19:41:30.003 STDOUT terraform: kubectl_manifest.kubero_operator[21]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system/serviceaccounts/kubero-operator-controller-manager]
19:41:30.009 STDOUT terraform: kubectl_manifest.kubero_operator[46]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-proxy-rolebinding]
19:41:30.010 STDOUT terraform: kubectl_manifest.kubero_operator[25]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-viewer-role]
19:41:30.045 STDOUT terraform: kubectl_manifest.kubero_operator[2]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmysqls.application.kubero.dev]
19:41:30.143 STDOUT terraform: kubectl_manifest.kubero_operator[26]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-admin-role]
19:41:30.208 STDOUT terraform: kubectl_manifest.kubero_operator[39]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-editor-role]
19:41:30.212 STDOUT terraform: kubectl_manifest.kubero_operator[29]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-admin-role]
19:41:30.222 STDOUT terraform: kubectl_manifest.kubero_operator[28]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-viewer-role]
19:41:30.228 STDOUT terraform: kubectl_manifest.kubero_operator[34]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-viewer-role]
19:41:30.230 STDOUT terraform: kubectl_manifest.kubero_operator[6]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoapps.application.kubero.dev]
19:41:30.264 STDOUT terraform: kubectl_manifest.kubero_operator[35]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-admin-role]
19:41:30.359 STDOUT terraform: kubectl_manifest.kubero_operator[7]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberobuilds.application.kubero.dev]
19:41:30.430 STDOUT terraform: kubectl_manifest.kubero_operator[1]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmongodbs.application.kubero.dev]
19:41:30.433 STDOUT terraform: kubectl_manifest.kubero_operator[32]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-admin-role]
19:41:30.440 STDOUT terraform: kubectl_manifest.kubero_operator[42]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-metrics-reader]
19:41:30.448 STDOUT terraform: kubectl_manifest.kubero_operator[38]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-admin-role]
19:41:30.451 STDOUT terraform: kubectl_manifest.kubero_operator[45]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-manager-rolebinding]
19:41:30.482 STDOUT terraform: kubectl_manifest.kubero_operator[49]: Refreshing state... [id=/apis/apps/v1/namespaces/kubero-operator-system/deployments/kubero-operator-controller-manager]
19:41:30.575 STDOUT terraform: kubectl_manifest.kubero_operator[47]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system/configmaps/kubero-operator-manager-config]
19:41:30.650 STDOUT terraform: kubectl_manifest.kubero_operator[30]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-editor-role]
19:41:30.651 STDOUT terraform: kubectl_manifest.kubero_operator[24]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-editor-role]
19:41:30.659 STDOUT terraform: kubectl_manifest.kubero_operator[33]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-editor-role]
19:41:30.665 STDOUT terraform: kubectl_manifest.kubero_operator[48]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system/services/kubero-operator-controller-manager-metrics-service]
19:41:30.669 STDOUT terraform: kubectl_manifest.kubero_operator[12]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomails.application.kubero.dev]
19:41:30.702 STDOUT terraform: kubectl_manifest.kubero_operator[20]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoredis.application.kubero.dev]
19:41:30.792 STDOUT terraform: kubectl_manifest.kubero_operator[16]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopipelines.application.kubero.dev]
19:41:30.868 STDOUT terraform: kubectl_manifest.kubero_operator[31]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-viewer-role]
19:41:30.869 STDOUT terraform: kubectl_manifest.kubero_operator[8]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberocouchdbs.application.kubero.dev]
19:41:30.885 STDOUT terraform: kubectl_manifest.kubero_operator[19]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberorabbitmqs.application.kubero.dev]
19:41:30.892 STDOUT terraform: kubectl_manifest.kubero_operator[44]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system/rolebindings/kubero-operator-leader-election-rolebinding]
19:41:30.903 STDOUT terraform: kubectl_manifest.kubero_operator[41]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-manager-role]
19:41:30.918 STDOUT terraform: kubectl_manifest.kubero_operator[40]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-viewer-role]
19:41:31.008 STDOUT terraform: kubectl_manifest.kubero_operator[0]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmemcacheds.application.kubero.dev]
19:41:31.086 STDOUT terraform: kubectl_manifest.kubero_operator[37]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-viewer-role]
19:41:31.089 STDOUT terraform: kubectl_manifest.kubero_operator[36]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-editor-role]
19:41:31.103 STDOUT terraform: kubectl_manifest.kubero_operator[23]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-admin-role]
19:41:31.108 STDOUT terraform: vault_kubernetes_auth_backend_role.kubero: Refreshing state... [id=auth/kubernetes/role/kubero]
19:41:31.138 STDOUT terraform: vault_kubernetes_auth_backend_config.config: Refreshing state... [id=auth/kubernetes/config]
19:41:31.144 STDOUT terraform: vault_kubernetes_auth_backend_role.vso: Refreshing state... [id=auth/kubernetes/role/vault-secrets-operator]
19:41:31.226 STDOUT terraform: vault_policy.reader[0]: Refreshing state... [id=reader]
19:41:31.362 STDOUT terraform: helm_release.casdoor[0]: Refreshing state... [id=casdoor]
19:41:31.364 STDOUT terraform: kubernetes_namespace.kubero: Refreshing state... [id=kubero]
19:41:31.374 STDOUT terraform: kubernetes_deployment.homer[0]: Refreshing state... [id=platform/homer]
19:41:31.782 STDOUT terraform: kubernetes_service_account.kubero: Refreshing state... [id=kubero/kubero]
19:41:31.878 STDOUT terraform: kubernetes_ingress_v1.homer[0]: Refreshing state... [id=platform/homer-ingress]
19:41:32.244 STDOUT terraform: vault_mount.database: Refreshing state... [id=database]
19:41:32.244 STDOUT terraform: vault_mount.kv: Refreshing state... [id=secret]
19:41:32.245 STDOUT terraform: kubernetes_ingress_v1.vault: Refreshing state... [id=platform/vault-ingress]
19:41:32.246 STDOUT terraform: helm_release.vault_secrets_operator: Refreshing state... [id=vault-secrets-operator]
19:41:32.462 STDOUT terraform: vault_kv_secret_v2.kubero: Refreshing state... [id=secret/data/kubero]
19:41:32.879 STDOUT terraform: data.vault_kv_secret_v2.kubero: Reading...
19:41:32.946 STDOUT terraform: kubernetes_cluster_role_binding.dashboard_api_admin: Refreshing state... [id=kubernetes-dashboard-api-admin]
19:41:32.946 STDOUT terraform: kubernetes_service_account.dashboard_admin: Refreshing state... [id=platform/dashboard-admin]
19:41:32.948 STDOUT terraform: kubernetes_ingress_v1.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
19:41:33.086 STDOUT terraform: data.vault_kv_secret_v2.kubero: Read complete after 0s [id=secret/data/kubero]
19:41:33.089 STDOUT terraform: kubernetes_secret.kubero_secrets: Refreshing state... [id=kubero/kubero-secrets]
19:41:33.091 STDOUT terraform: kubectl_manifest.kubero_instance: Refreshing state... [id=/apis/application.kubero.dev/v1alpha1/namespaces/kubero/kuberos/kubero]
19:41:33.366 STDOUT terraform: kubernetes_cluster_role_binding.dashboard_admin: Refreshing state... [id=dashboard-admin]
19:41:33.366 STDOUT terraform: kubernetes_secret.dashboard_admin_token: Refreshing state... [id=platform/dashboard-admin-token]
19:41:36.231 STDOUT terraform: helm_release.portal_auth[0]: Refreshing state... [id=portal-auth]
19:41:36.231 STDOUT terraform: restapi_object.role_vault_developer[0]: Refreshing state... [id=vault-developer]
19:41:36.232 STDOUT terraform: restapi_object.role_vault_viewer[0]: Refreshing state... [id=vault-viewer]
19:41:36.233 STDOUT terraform: restapi_object.provider_github[0]: Refreshing state... [id=GitHub]
19:41:36.233 STDOUT terraform: restapi_object.role_vault_admin[0]: Refreshing state... [id=vault-admin]
19:41:36.482 STDOUT terraform: time_sleep.wait_for_vso_crd: Refreshing state... [id=2025-12-23T10:52:00Z]
19:41:37.301 STDOUT terraform: restapi_object.app_vault_oidc[0]: Refreshing state... [id=vault-oidc]
19:41:37.304 STDOUT terraform: restapi_object.app_portal_gate[0]: Refreshing state... [id=portal-gate]
19:41:37.304 STDOUT terraform: restapi_object.app_dashboard_oidc[0]: Refreshing state... [id=dashboard-oidc]
19:41:37.304 STDOUT terraform: restapi_object.app_kubero_oidc[0]: Refreshing state... [id=kubero-oidc]
19:41:37.873 STDOUT terraform: time_sleep.wait_for_portal_auth[0]: Refreshing state... [id=2025-12-19T09:58:42Z]
19:41:37.880 STDOUT terraform: data.http.portal_auth_ping[0]: Reading...
19:41:38.223 STDOUT terraform: data.http.casdoor_oidc_discovery[0]: Reading...
19:41:38.713 STDOUT terraform: data.http.portal_auth_ping[0]: Read complete after 1s [id=https://auth.zitian.party/ping]
19:41:38.857 STDOUT terraform: data.http.casdoor_oidc_discovery[0]: Read complete after 1s [id=https://sso.zitian.party/.well-known/openid-configuration]
19:41:38.861 STDOUT terraform: vault_jwt_auth_backend.oidc[0]: Refreshing state... [id=oidc]
19:41:39.487 STDOUT terraform: vault_identity_group_alias.admin_namespaced[0]: Refreshing state... [id=4f89a529-545d-5208-4ce0-bbfc6f7f81cc]
19:41:39.487 STDOUT terraform: vault_identity_group_alias.admin_builtin[0]: Refreshing state... [id=6197e6bd-4daa-e1d5-940e-24e1c9096ebf]
19:41:39.487 STDOUT terraform: vault_identity_group_alias.viewer_namespaced[0]: Refreshing state... [id=1f49ae4f-983f-9c9c-fb25-6bf2e3971d18]
19:41:39.487 STDOUT terraform: vault_identity_group_alias.developer_namespaced[0]: Refreshing state... [id=845f51cf-7421-e12a-deb8-168563cb0cf2]
19:41:39.488 STDOUT terraform: vault_identity_group_alias.admin_simple[0]: Refreshing state... [id=c0f961f0-cc0c-3e4d-549e-c976186b4bd7]
19:41:39.488 STDOUT terraform: vault_identity_group_alias.developer_simple[0]: Refreshing state... [id=24e3efa8-aeb9-2d0c-8560-ce2059c3d5da]
19:41:39.488 STDOUT terraform: vault_identity_group_alias.viewer_simple[0]: Refreshing state... [id=4deefb07-a7ed-2c16-33ba-c1a444480869]
19:41:39.489 STDOUT terraform: vault_identity_group_alias.developer_builtin[0]: Refreshing state... [id=adbcc54d-1bec-d67d-09c0-709b58552670]
19:41:39.489 STDOUT terraform: vault_jwt_auth_backend_role.reader[0]: Refreshing state... [id=auth/oidc/role/reader]
19:41:39.699 STDOUT terraform: vault_jwt_auth_backend_role.default[0]: Refreshing state... [id=auth/oidc/role/default]
19:41:41.227 STDOUT terraform: kubernetes_manifest.portal_auth_middleware_platform[0]: Refreshing state...
19:41:41.671 STDOUT terraform: Terraform used the selected providers to generate the following execution
19:41:41.671 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
19:41:41.671 STDOUT terraform:   + create
19:41:41.671 STDOUT terraform: Terraform will perform the following actions:
19:41:41.671 STDOUT terraform:   # vault_identity_group_alias.admin_builtin[0] will be created
19:41:41.671 STDOUT terraform:   + resource "vault_identity_group_alias" "admin_builtin" {
19:41:41.671 STDOUT terraform:       + canonical_id   = "0ac3b38e-52bb-3a86-d72d-71ad31784ee3"
19:41:41.671 STDOUT terraform:       + id             = (known after apply)
19:41:41.672 STDOUT terraform:       + mount_accessor = "auth_oidc_93901082"
19:41:41.672 STDOUT terraform:       + name           = "built-in/vault-admin"
19:41:41.672 STDOUT terraform:     }
19:41:41.672 STDOUT terraform:   # vault_identity_group_alias.admin_namespaced[0] will be created
19:41:41.672 STDOUT terraform:   + resource "vault_identity_group_alias" "admin_namespaced" {
19:41:41.672 STDOUT terraform:       + canonical_id   = "0ac3b38e-52bb-3a86-d72d-71ad31784ee3"
19:41:41.672 STDOUT terraform:       + id             = (known after apply)
19:41:41.672 STDOUT terraform:       + mount_accessor = "auth_oidc_93901082"
19:41:41.672 STDOUT terraform:       + name           = "admin/vault-admin"
19:41:41.672 STDOUT terraform:     }
19:41:41.672 STDOUT terraform:   # vault_identity_group_alias.developer_namespaced[0] will be created
19:41:41.672 STDOUT terraform:   + resource "vault_identity_group_alias" "developer_namespaced" {
19:41:41.672 STDOUT terraform:       + canonical_id   = "f7e4fa30-a522-c524-6927-6e0f8c21d4f3"
19:41:41.672 STDOUT terraform:       + id             = (known after apply)
19:41:41.672 STDOUT terraform:       + mount_accessor = "auth_oidc_93901082"
19:41:41.672 STDOUT terraform:       + name           = "admin/vault-developer"
19:41:41.672 STDOUT terraform:     }
19:41:41.672 STDOUT terraform:   # vault_identity_group_alias.developer_simple[0] will be created
19:41:41.672 STDOUT terraform:   + resource "vault_identity_group_alias" "developer_simple" {
19:41:41.672 STDOUT terraform:       + canonical_id   = "f7e4fa30-a522-c524-6927-6e0f8c21d4f3"
19:41:41.672 STDOUT terraform:       + id             = (known after apply)
19:41:41.672 STDOUT terraform:       + mount_accessor = "auth_oidc_93901082"
19:41:41.672 STDOUT terraform:       + name           = "vault-developer"
19:41:41.672 STDOUT terraform:     }
19:41:41.672 STDOUT terraform:   # vault_identity_group_alias.viewer_namespaced[0] will be created
19:41:41.672 STDOUT terraform:   + resource "vault_identity_group_alias" "viewer_namespaced" {
19:41:41.672 STDOUT terraform:       + canonical_id   = "89e06fbb-fc87-9471-ecc7-04b5747e4b06"
19:41:41.672 STDOUT terraform:       + id             = (known after apply)
19:41:41.672 STDOUT terraform:       + mount_accessor = "auth_oidc_93901082"
19:41:41.672 STDOUT terraform:       + name           = "admin/vault-viewer"
19:41:41.672 STDOUT terraform:     }
19:41:41.672 STDOUT terraform: Plan: 5 to add, 0 to change, 0 to destroy.
19:41:41.672 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
19:41:41.673 STDOUT terraform: Saved the plan to: tfplan
19:41:41.673 STDOUT terraform: To perform exactly these actions, run the following command to apply:
19:41:41.673 STDOUT terraform:     terraform apply "tfplan"
```

### 📦 envs/staging/data

```terraform
19:41:50.165 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
19:41:50.195 WARN   Config ../../../platform/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
19:41:52.291 STDOUT terraform: data.terraform_remote_state.platform: Reading...
19:41:52.292 STDOUT terraform: random_bytes.arangodb_jwt: Refreshing state...
19:41:52.292 STDOUT terraform: random_password.arangodb: Refreshing state... [id=none]
19:41:52.292 STDOUT terraform: random_password.signoz_clickhouse: Refreshing state... [id=none]
19:41:52.295 STDOUT terraform: random_password.openpanel_postgres: Refreshing state... [id=none]
19:41:52.295 STDOUT terraform: random_password.clickhouse: Refreshing state... [id=none]
19:41:52.295 STDOUT terraform: random_password.postgres: Refreshing state... [id=none]
19:41:52.296 STDOUT terraform: random_password.redis: Refreshing state... [id=none]
19:41:52.296 STDOUT terraform: random_password.openpanel_clickhouse: Refreshing state... [id=none]
19:41:52.310 STDOUT terraform: kubernetes_namespace.data: Refreshing state... [id=data-staging]
19:41:53.082 STDOUT terraform: data.terraform_remote_state.platform: Read complete after 1s
19:41:53.155 STDOUT terraform: time_sleep.wait_for_vso: Refreshing state... [id=2025-12-25T18:40:33Z]
19:41:53.159 STDOUT terraform: vault_kv_secret_v2.arangodb: Refreshing state... [id=secret/data/arangodb]
19:41:53.159 STDOUT terraform: vault_kv_secret_v2.postgres: Refreshing state... [id=secret/data/postgres]
19:41:53.159 STDOUT terraform: vault_kv_secret_v2.redis: Refreshing state... [id=secret/data/redis]
19:41:53.159 STDOUT terraform: vault_kv_secret_v2.clickhouse: Refreshing state... [id=secret/data/clickhouse]
19:41:53.159 STDOUT terraform: helm_release.redis_operator: Refreshing state... [id=redis-operator]
19:41:53.161 STDOUT terraform: helm_release.clickhouse_operator: Refreshing state... [id=clickhouse-operator]
19:41:53.166 STDOUT terraform: kubectl_manifest.vault_auth: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-staging/vaultauths/default]
19:41:54.439 STDOUT terraform: kubectl_manifest.clickhouse_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-staging/vaultstaticsecrets/clickhouse-credentials]
19:41:54.447 STDOUT terraform: kubectl_manifest.redis_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-staging/vaultstaticsecrets/redis-credentials]
19:41:54.447 STDOUT terraform: kubectl_manifest.postgres_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-staging/vaultstaticsecrets/postgresql-credentials]
19:41:54.450 STDOUT terraform: kubectl_manifest.arangodb_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-staging/vaultstaticsecrets/arangodb-credentials]
19:41:54.659 STDOUT terraform: time_sleep.wait_for_clickhouse_secret: Refreshing state... [id=2025-12-25T18:40:51Z]
19:41:54.666 STDOUT terraform: time_sleep.wait_for_postgres_secret: Refreshing state... [id=2025-12-25T18:40:51Z]
19:41:54.671 STDOUT terraform: kubectl_manifest.postgresql_cluster: Refreshing state... [id=/apis/postgresql.cnpg.io/v1/namespaces/data-staging/clusters/postgresql]
19:41:54.679 STDOUT terraform: time_sleep.wait_for_arangodb_secret: Refreshing state... [id=2025-12-25T18:40:51Z]
19:41:54.689 STDOUT terraform: time_sleep.wait_for_redis_secret: Refreshing state... [id=2025-12-25T18:40:51Z]
19:41:54.933 STDOUT terraform: time_sleep.wait_for_postgresql_cluster: Refreshing state... [id=2025-12-25T18:41:53Z]
19:41:54.939 STDOUT terraform: kubectl_manifest.openpanel_postgres_init: Refreshing state... [id=/apis/batch/v1/namespaces/data-staging/jobs/openpanel-postgres-init]
19:41:57.310 STDOUT terraform: time_sleep.wait_for_redis_crd: Refreshing state... [id=2025-12-25T18:41:27Z]
19:41:57.923 STDOUT terraform: time_sleep.wait_for_clickhouse_crd: Refreshing state... [id=2025-12-25T18:41:47Z]
19:41:57.928 STDOUT terraform: kubectl_manifest.clickhouse_installation: Refreshing state... [id=/apis/clickhouse.altinity.com/v1/namespaces/data-staging/clickhouseinstallations/clickhouse]
19:41:58.180 STDOUT terraform: time_sleep.wait_for_clickhouse: Refreshing state... [id=2025-12-25T18:42:20Z]
19:41:58.188 STDOUT terraform: vault_kv_secret_v2.signoz: Refreshing state... [id=secret/data/signoz]
19:41:58.650 STDOUT terraform: Terraform used the selected providers to generate the following execution
19:41:58.650 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
19:41:58.651 STDOUT terraform:   + create
19:41:58.651 STDOUT terraform: Terraform will perform the following actions:
19:41:58.651 STDOUT terraform:   # clickhousedbops_database.openpanel_events will be created
19:41:58.651 STDOUT terraform:   + resource "clickhousedbops_database" "openpanel_events" {
19:41:58.651 STDOUT terraform:       + name = "openpanel_events"
19:41:58.651 STDOUT terraform:       + uuid = (known after apply)
19:41:58.651 STDOUT terraform:     }
19:41:58.651 STDOUT terraform:   # clickhousedbops_database.signoz_logs will be created
19:41:58.651 STDOUT terraform:   + resource "clickhousedbops_database" "signoz_logs" {
19:41:58.651 STDOUT terraform:       + name = "signoz_logs"
19:41:58.651 STDOUT terraform:       + uuid = (known after apply)
19:41:58.651 STDOUT terraform:     }
19:41:58.651 STDOUT terraform:   # clickhousedbops_database.signoz_metrics will be created
19:41:58.651 STDOUT terraform:   + resource "clickhousedbops_database" "signoz_metrics" {
19:41:58.651 STDOUT terraform:       + name = "signoz_metrics"
19:41:58.651 STDOUT terraform:       + uuid = (known after apply)
19:41:58.651 STDOUT terraform:     }
19:41:58.651 STDOUT terraform:   # clickhousedbops_database.signoz_traces will be created
19:41:58.651 STDOUT terraform:   + resource "clickhousedbops_database" "signoz_traces" {
19:41:58.651 STDOUT terraform:       + name = "signoz_traces"
19:41:58.651 STDOUT terraform:       + uuid = (known after apply)
19:41:58.651 STDOUT terraform:     }
19:41:58.651 STDOUT terraform:   # clickhousedbops_user.openpanel will be created
19:41:58.651 STDOUT terraform:   + resource "clickhousedbops_user" "openpanel" {
19:41:58.651 STDOUT terraform:       + id                              = (known after apply)
19:41:58.652 STDOUT terraform:       + name                            = "openpanel"
19:41:58.652 STDOUT terraform:       + password_sha256_hash_wo         = (write-only attribute)
19:41:58.652 STDOUT terraform:       + password_sha256_hash_wo_version = 1
19:41:58.652 STDOUT terraform:     }
19:41:58.652 STDOUT terraform:   # clickhousedbops_user.signoz will be created
19:41:58.652 STDOUT terraform:   + resource "clickhousedbops_user" "signoz" {
19:41:58.652 STDOUT terraform:       + id                              = (known after apply)
19:41:58.652 STDOUT terraform:       + name                            = "signoz"
19:41:58.652 STDOUT terraform:       + password_sha256_hash_wo         = (write-only attribute)
19:41:58.652 STDOUT terraform:       + password_sha256_hash_wo_version = 1
19:41:58.652 STDOUT terraform:     }
19:41:58.652 STDOUT terraform:   # helm_release.arangodb_operator will be created
19:41:58.652 STDOUT terraform:   + resource "helm_release" "arangodb_operator" {
19:41:58.652 STDOUT terraform:       + atomic                     = false
19:41:58.652 STDOUT terraform:       + chart                      = "kube-arangodb"
19:41:58.652 STDOUT terraform:       + cleanup_on_fail            = false
19:41:58.652 STDOUT terraform:       + create_namespace           = false
19:41:58.652 STDOUT terraform:       + dependency_update          = false
19:41:58.652 STDOUT terraform:       + disable_crd_hooks          = false
19:41:58.652 STDOUT terraform:       + disable_openapi_validation = false
19:41:58.652 STDOUT terraform:       + disable_webhooks           = false
19:41:58.652 STDOUT terraform:       + force_update               = false
19:41:58.653 STDOUT terraform:       + id                         = (known after apply)
19:41:58.653 STDOUT terraform:       + lint                       = false
19:41:58.653 STDOUT terraform:       + manifest                   = (known after apply)
19:41:58.653 STDOUT terraform:       + max_history                = 0
19:41:58.653 STDOUT terraform:       + metadata                   = (known after apply)
19:41:58.653 STDOUT terraform:       + name                       = "arangodb-operator"
19:41:58.653 STDOUT terraform:       + namespace                  = "data-staging"
19:41:58.653 STDOUT terraform:       + pass_credentials           = false
19:41:58.653 STDOUT terraform:       + recreate_pods              = false
19:41:58.653 STDOUT terraform:       + render_subchart_notes      = true
19:41:58.653 STDOUT terraform:       + replace                    = false
19:41:58.653 STDOUT terraform:       + repository                 = "https://arangodb.github.io/kube-arangodb"
19:41:58.653 STDOUT terraform:       + reset_values               = false
19:41:58.653 STDOUT terraform:       + reuse_values               = false
19:41:58.653 STDOUT terraform:       + skip_crds                  = false
19:41:58.653 STDOUT terraform:       + status                     = "deployed"
19:41:58.653 STDOUT terraform:       + timeout                    = 300
19:41:58.653 STDOUT terraform:       + values                     = [
19:41:58.653 STDOUT terraform:           + <<-EOT
19:41:58.653 STDOUT terraform:                 "operator":
19:41:58.653 STDOUT terraform:                   "replicaCount": 1
19:41:58.653 STDOUT terraform:                   "resources":
19:41:58.654 STDOUT terraform:                     "limits":
19:41:58.654 STDOUT terraform:                       "cpu": "200m"
19:41:58.654 STDOUT terraform:                       "memory": "256Mi"
19:41:58.654 STDOUT terraform:                     "requests":
19:41:58.654 STDOUT terraform:                       "cpu": "50m"
19:41:58.654 STDOUT terraform:                       "memory": "64Mi"
19:41:58.654 STDOUT terraform:             EOT,
19:41:58.654 STDOUT terraform:         ]
19:41:58.654 STDOUT terraform:       + verify                     = false
19:41:58.654 STDOUT terraform:       + version                    = "1.2.43"
19:41:58.654 STDOUT terraform:       + wait                       = true
19:41:58.654 STDOUT terraform:       + wait_for_jobs              = true
19:41:58.654 STDOUT terraform:     }
19:41:58.654 STDOUT terraform:   # kubectl_manifest.arangodb_deployment will be created
19:41:58.654 STDOUT terraform:   + resource "kubectl_manifest" "arangodb_deployment" {
19:41:58.654 STDOUT terraform:       + api_version             = "database.arangodb.com/v1"
19:41:58.654 STDOUT terraform:       + apply_only              = false
19:41:58.654 STDOUT terraform:       + field_manager           = "kubectl"
19:41:58.654 STDOUT terraform:       + force_conflicts         = false
19:41:58.654 STDOUT terraform:       + force_new               = false
19:41:58.654 STDOUT terraform:       + id                      = (known after apply)
19:41:58.654 STDOUT terraform:       + kind                    = "ArangoDeployment"
19:41:58.654 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
19:41:58.654 STDOUT terraform:       + live_uid                = (known after apply)
19:41:58.654 STDOUT terraform:       + name                    = "arangodb"
19:41:58.654 STDOUT terraform:       + namespace               = "data-staging"
19:41:58.655 STDOUT terraform:       + server_side_apply       = false
19:41:58.655 STDOUT terraform:       + uid                     = (known after apply)
19:41:58.655 STDOUT terraform:       + validate_schema         = true
19:41:58.655 STDOUT terraform:       + wait_for_rollout        = true
19:41:58.655 STDOUT terraform:       + yaml_body               = (sensitive value)
19:41:58.655 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
19:41:58.655 STDOUT terraform:             apiVersion: database.arangodb.com/v1
19:41:58.655 STDOUT terraform:             kind: ArangoDeployment
19:41:58.655 STDOUT terraform:             metadata:
19:41:58.655 STDOUT terraform:               name: arangodb
19:41:58.655 STDOUT terraform:               namespace: data-staging
19:41:58.655 STDOUT terraform:             spec:
19:41:58.655 STDOUT terraform:               auth:
19:41:58.655 STDOUT terraform:                 jwtSecretName: arangodb-credentials
19:41:58.655 STDOUT terraform:               image: arangodb/arangodb:3.11.8
19:41:58.655 STDOUT terraform:               mode: Single
19:41:58.655 STDOUT terraform:               single:
19:41:58.655 STDOUT terraform:                 count: 1
19:41:58.655 STDOUT terraform:                 resources:
19:41:58.655 STDOUT terraform:                   limits:
19:41:58.655 STDOUT terraform:                     cpu: 500m
19:41:58.655 STDOUT terraform:                     memory: 512Mi
19:41:58.655 STDOUT terraform:                   requests:
19:41:58.655 STDOUT terraform:                     cpu: 100m
19:41:58.655 STDOUT terraform:                     memory: 128Mi
19:41:58.655 STDOUT terraform:                 volumeClaimTemplate:
19:41:58.655 STDOUT terraform:                   spec:
19:41:58.655 STDOUT terraform:                     accessModes:
19:41:58.655 STDOUT terraform:                     - ReadWriteOnce
19:41:58.655 STDOUT terraform:                     resources:
19:41:58.655 STDOUT terraform:                       requests:
19:41:58.655 STDOUT terraform:                         storage: 5Gi
19:41:58.655 STDOUT terraform:                     storageClassName: local-path-retain
19:41:58.655 STDOUT terraform:         EOT
19:41:58.655 STDOUT terraform:       + yaml_incluster          = (sensitive value)
19:41:58.655 STDOUT terraform:     }
19:41:58.655 STDOUT terraform:   # kubectl_manifest.redis will be created
19:41:58.655 STDOUT terraform:   + resource "kubectl_manifest" "redis" {
19:41:58.655 STDOUT terraform:       + api_version             = "redis.redis.opstreelabs.in/v1beta2"
19:41:58.655 STDOUT terraform:       + apply_only              = false
19:41:58.655 STDOUT terraform:       + field_manager           = "kubectl"
19:41:58.655 STDOUT terraform:       + force_conflicts         = false
19:41:58.655 STDOUT terraform:       + force_new               = false
19:41:58.655 STDOUT terraform:       + id                      = (known after apply)
19:41:58.655 STDOUT terraform:       + kind                    = "Redis"
19:41:58.655 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
19:41:58.655 STDOUT terraform:       + live_uid                = (known after apply)
19:41:58.656 STDOUT terraform:       + name                    = "redis-master"
19:41:58.656 STDOUT terraform:       + namespace               = "data-staging"
19:41:58.656 STDOUT terraform:       + server_side_apply       = false
19:41:58.656 STDOUT terraform:       + uid                     = (known after apply)
19:41:58.656 STDOUT terraform:       + validate_schema         = true
19:41:58.656 STDOUT terraform:       + wait_for_rollout        = true
19:41:58.656 STDOUT terraform:       + yaml_body               = (sensitive value)
19:41:58.656 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
19:41:58.656 STDOUT terraform:             apiVersion: redis.redis.opstreelabs.in/v1beta2
19:41:58.656 STDOUT terraform:             kind: Redis
19:41:58.656 STDOUT terraform:             metadata:
19:41:58.656 STDOUT terraform:               labels:
19:41:58.656 STDOUT terraform:                 env: staging
19:41:58.656 STDOUT terraform:                 module: data
19:41:58.656 STDOUT terraform:               name: redis-master
19:41:58.656 STDOUT terraform:               namespace: data-staging
19:41:58.656 STDOUT terraform:             spec:
19:41:58.656 STDOUT terraform:               kubernetesConfig:
19:41:58.656 STDOUT terraform:                 image: quay.io/opstree/redis:v7.0.15
19:41:58.656 STDOUT terraform:                 imagePullPolicy: IfNotPresent
19:41:58.656 STDOUT terraform:                 redisSecret:
19:41:58.656 STDOUT terraform:                   key: password
19:41:58.656 STDOUT terraform:                   name: redis-credentials
19:41:58.656 STDOUT terraform:                 resources:
19:41:58.656 STDOUT terraform:                   limits:
19:41:58.656 STDOUT terraform:                     cpu: 200m
19:41:58.656 STDOUT terraform:                     memory: 256Mi
19:41:58.656 STDOUT terraform:                   requests:
19:41:58.656 STDOUT terraform:                     cpu: 50m
19:41:58.656 STDOUT terraform:                     memory: 64Mi
19:41:58.656 STDOUT terraform:                 service:
19:41:58.656 STDOUT terraform:                   additional:
19:41:58.656 STDOUT terraform:                     enabled: false
19:41:58.656 STDOUT terraform:               redisConfig:
19:41:58.656 STDOUT terraform:                 additionalRedisConfig: |
19:41:58.656 STDOUT terraform:                   appendonly yes
19:41:58.656 STDOUT terraform:                   appendfsync everysec
19:41:58.656 STDOUT terraform:                   save 900 1
19:41:58.656 STDOUT terraform:                   save 300 10
19:41:58.656 STDOUT terraform:                   save 60 10000
19:41:58.656 STDOUT terraform:               storage:
19:41:58.656 STDOUT terraform:                 keepAfterDelete: true
19:41:58.656 STDOUT terraform:                 volumeClaimTemplate:
19:41:58.656 STDOUT terraform:                   spec:
19:41:58.656 STDOUT terraform:                     accessModes:
19:41:58.656 STDOUT terraform:                     - ReadWriteOnce
19:41:58.656 STDOUT terraform:                     resources:
19:41:58.656 STDOUT terraform:                       requests:
19:41:58.656 STDOUT terraform:                         storage: 2Gi
19:41:58.656 STDOUT terraform:                     storageClassName: local-path-retain
19:41:58.656 STDOUT terraform:         EOT
19:41:58.656 STDOUT terraform:       + yaml_incluster          = (sensitive value)
19:41:58.657 STDOUT terraform:     }
19:41:58.657 STDOUT terraform:   # time_sleep.wait_for_arangodb_crd will be created
19:41:58.657 STDOUT terraform:   + resource "time_sleep" "wait_for_arangodb_crd" {
19:41:58.657 STDOUT terraform:       + create_duration = "30s"
19:41:58.657 STDOUT terraform:       + id              = (known after apply)
19:41:58.657 STDOUT terraform:     }
19:41:58.657 STDOUT terraform:   # vault_database_secret_backend_connection.postgres will be created
19:41:58.657 STDOUT terraform:   + resource "vault_database_secret_backend_connection" "postgres" {
19:41:58.657 STDOUT terraform:       + allowed_roles     = [
19:41:58.657 STDOUT terraform:           + "postgres-readonly",
19:41:58.657 STDOUT terraform:           + "postgres-readwrite",
19:41:58.657 STDOUT terraform:         ]
19:41:58.657 STDOUT terraform:       + backend           = "database"
19:41:58.657 STDOUT terraform:       + id                = (known after apply)
19:41:58.657 STDOUT terraform:       + name              = "postgres"
19:41:58.657 STDOUT terraform:       + plugin_name       = (known after apply)
19:41:58.657 STDOUT terraform:       + verify_connection = true
19:41:58.657 STDOUT terraform:       + postgresql {
19:41:58.657 STDOUT terraform:           + connection_url          = (sensitive value)
19:41:58.657 STDOUT terraform:           + max_open_connections    = 2
19:41:58.657 STDOUT terraform:           + password_authentication = "password"
19:41:58.657 STDOUT terraform:         }
19:41:58.657 STDOUT terraform:     }
19:41:58.657 STDOUT terraform:   # vault_database_secret_backend_role.postgres_readonly will be created
19:41:58.657 STDOUT terraform:   + resource "vault_database_secret_backend_role" "postgres_readonly" {
19:41:58.657 STDOUT terraform:       + backend               = "database"
19:41:58.657 STDOUT terraform:       + creation_statements   = [
19:41:58.657 STDOUT terraform:           + "CREATE ROLE \"{{name}}\" WITH LOGIN PASSWORD '{{password}}' VALID UNTIL '{{expiration}}';",
19:41:58.657 STDOUT terraform:           + "GRANT SELECT ON ALL TABLES IN SCHEMA public TO \"{{name}}\";",
19:41:58.657 STDOUT terraform:           + "GRANT USAGE ON SCHEMA public TO \"{{name}}\";",
19:41:58.657 STDOUT terraform:         ]
19:41:58.657 STDOUT terraform:       + credential_type       = (known after apply)
19:41:58.657 STDOUT terraform:       + db_name               = "postgres"
19:41:58.657 STDOUT terraform:       + default_ttl           = 3600
19:41:58.657 STDOUT terraform:       + id                    = (known after apply)
19:41:58.657 STDOUT terraform:       + max_ttl               = 86400
19:41:58.657 STDOUT terraform:       + name                  = "postgres-readonly"
19:41:58.657 STDOUT terraform:       + revocation_statements = [
19:41:58.657 STDOUT terraform:           + "REVOKE ALL PRIVILEGES ON ALL TABLES IN SCHEMA public FROM \"{{name}}\";",
19:41:58.657 STDOUT terraform:           + "DROP ROLE IF EXISTS \"{{name}}\";",
19:41:58.657 STDOUT terraform:         ]
19:41:58.658 STDOUT terraform:     }
19:41:58.658 STDOUT terraform:   # vault_database_secret_backend_role.postgres_readwrite will be created
19:41:58.658 STDOUT terraform:   + resource "vault_database_secret_backend_role" "postgres_readwrite" {
19:41:58.658 STDOUT terraform:       + backend               = "database"
19:41:58.658 STDOUT terraform:       + creation_statements   = [
19:41:58.658 STDOUT terraform:           + "CREATE ROLE \"{{name}}\" WITH LOGIN PASSWORD '{{password}}' VALID UNTIL '{{expiration}}';",
19:41:58.658 STDOUT terraform:           + "GRANT SELECT, INSERT, UPDATE, DELETE ON ALL TABLES IN SCHEMA public TO \"{{name}}\";",
19:41:58.658 STDOUT terraform:           + "GRANT USAGE, SELECT ON ALL SEQUENCES IN SCHEMA public TO \"{{name}}\";",
19:41:58.658 STDOUT terraform:           + "GRANT USAGE ON SCHEMA public TO \"{{name}}\";",
19:41:58.658 STDOUT terraform:         ]
19:41:58.658 STDOUT terraform:       + credential_type       = (known after apply)
19:41:58.658 STDOUT terraform:       + db_name               = "postgres"
19:41:58.658 STDOUT terraform:       + default_ttl           = 3600
19:41:58.658 STDOUT terraform:       + id                    = (known after apply)
19:41:58.658 STDOUT terraform:       + max_ttl               = 86400
19:41:58.658 STDOUT terraform:       + name                  = "postgres-readwrite"
19:41:58.658 STDOUT terraform:       + revocation_statements = [
19:41:58.658 STDOUT terraform:           + "REVOKE ALL PRIVILEGES ON ALL TABLES IN SCHEMA public FROM \"{{name}}\";",
19:41:58.658 STDOUT terraform:           + "REVOKE ALL PRIVILEGES ON ALL SEQUENCES IN SCHEMA public FROM \"{{name}}\";",
19:41:58.658 STDOUT terraform:           + "DROP ROLE IF EXISTS \"{{name}}\";",
19:41:58.658 STDOUT terraform:         ]
19:41:58.658 STDOUT terraform:     }
19:41:58.658 STDOUT terraform:   # vault_kv_secret_v2.openpanel will be created
19:41:58.658 STDOUT terraform:   + resource "vault_kv_secret_v2" "openpanel" {
19:41:58.658 STDOUT terraform:       + data                = (sensitive value)
19:41:58.658 STDOUT terraform:       + data_json           = (sensitive value)
19:41:58.658 STDOUT terraform:       + delete_all_versions = true
19:41:58.658 STDOUT terraform:       + disable_read        = false
19:41:58.658 STDOUT terraform:       + id                  = (known after apply)
19:41:58.658 STDOUT terraform:       + metadata            = (known after apply)
19:41:58.658 STDOUT terraform:       + mount               = "secret"
19:41:58.658 STDOUT terraform:       + name                = "openpanel"
19:41:58.658 STDOUT terraform:       + path                = (known after apply)
19:41:58.658 STDOUT terraform:       + custom_metadata (known after apply)
19:41:58.658 STDOUT terraform:     }
19:41:58.658 STDOUT terraform: Plan: 14 to add, 0 to change, 0 to destroy.
19:41:58.658 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
19:41:58.659 STDOUT terraform: Saved the plan to: tfplan
19:41:58.659 STDOUT terraform: To perform exactly these actions, run the following command to apply:
19:41:58.659 STDOUT terraform:     terraform apply "tfplan"
```

### 📦 envs/prod/data

```terraform
19:42:06.429 WARN   Using `terragrunt.hcl` as the root of Terragrunt configurations is an anti-pattern, and no longer recommended. In a future version of Terragrunt, this will result in an error. You are advised to use a differently named file like `root.hcl` instead. For more information, see https://terragrunt.gruntwork.io/docs/migrate/migrating-from-root-terragrunt-hcl
19:42:06.463 WARN   Config ../../../platform/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
19:42:08.524 STDOUT terraform: data.terraform_remote_state.platform: Reading...
19:42:08.531 STDOUT terraform: helm_release.clickhouse: Refreshing state... [id=clickhouse]
19:42:08.531 STDOUT terraform: helm_release.redis: Refreshing state... [id=redis]
19:42:08.534 STDOUT terraform: helm_release.postgresql: Refreshing state... [id=postgresql]
19:42:08.534 STDOUT terraform: random_password.openpanel_clickhouse: Refreshing state... [id=none]
19:42:08.535 STDOUT terraform: random_password.openpanel_postgres: Refreshing state... [id=none]
19:42:08.537 STDOUT terraform: random_password.clickhouse: Refreshing state... [id=none]
19:42:08.538 STDOUT terraform: random_bytes.arangodb_jwt: Refreshing state...
19:42:08.538 STDOUT terraform: random_password.redis: Refreshing state... [id=none]
19:42:08.539 STDOUT terraform: random_password.signoz_clickhouse: Refreshing state... [id=none]
19:42:08.554 STDOUT terraform: random_password.arangodb: Refreshing state... [id=none]
19:42:08.605 STDOUT terraform: random_password.postgres: Refreshing state... [id=none]
19:42:08.605 STDOUT terraform: kubernetes_namespace.data: Refreshing state... [id=data-prod]
19:42:09.323 STDOUT terraform: data.terraform_remote_state.platform: Read complete after 0s
19:42:09.445 STDOUT terraform: vault_kv_secret_v2.redis: Refreshing state... [id=secret/data/redis]
19:42:09.446 STDOUT terraform: vault_kv_secret_v2.clickhouse: Refreshing state... [id=secret/data/clickhouse]
19:42:09.446 STDOUT terraform: vault_kv_secret_v2.arangodb: Refreshing state... [id=secret/data/arangodb]
19:42:09.446 STDOUT terraform: helm_release.arangodb_operator: Refreshing state... [id=arangodb-operator]
19:42:09.446 STDOUT terraform: vault_kv_secret_v2.postgres: Refreshing state... [id=secret/data/postgres]
19:42:09.447 STDOUT terraform: time_sleep.wait_for_vso: Refreshing state... [id=2025-12-23T17:36:28Z]
19:42:09.455 STDOUT terraform: kubectl_manifest.vault_auth: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-prod/vaultauths/default]
19:42:10.712 STDOUT terraform: kubectl_manifest.redis_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-prod/vaultstaticsecrets/redis-credentials]
19:42:10.714 STDOUT terraform: kubectl_manifest.clickhouse_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-prod/vaultstaticsecrets/clickhouse-credentials]
19:42:10.714 STDOUT terraform: kubectl_manifest.arangodb_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-prod/vaultstaticsecrets/arangodb-credentials]
19:42:10.726 STDOUT terraform: kubectl_manifest.postgres_vault_secret: Refreshing state... [id=/apis/secrets.hashicorp.com/v1beta1/namespaces/data-prod/vaultstaticsecrets/postgresql-credentials]
19:42:10.935 STDOUT terraform: time_sleep.wait_for_clickhouse_secret: Refreshing state... [id=2025-12-23T17:36:44Z]
19:42:10.935 STDOUT terraform: time_sleep.wait_for_redis_secret: Refreshing state... [id=2025-12-23T17:36:44Z]
19:42:10.944 STDOUT terraform: time_sleep.wait_for_arangodb_secret: Refreshing state... [id=2025-12-23T17:36:44Z]
19:42:10.955 STDOUT terraform: time_sleep.wait_for_postgres_secret: Refreshing state... [id=2025-12-23T17:36:44Z]
19:42:10.968 STDOUT terraform: kubectl_manifest.openpanel_postgres_init: Refreshing state... [id=/apis/batch/v1/namespaces/data-prod/jobs/openpanel-postgres-init]
19:42:11.289 STDOUT terraform: time_sleep.wait_for_clickhouse: Refreshing state... [id=2025-12-23T03:02:26Z]
19:42:11.294 STDOUT terraform: vault_kv_secret_v2.signoz: Refreshing state... [id=secret/data/signoz]
19:42:11.559 STDOUT terraform: vault_kv_secret_v2.openpanel: Refreshing state... [id=secret/data/openpanel]
19:42:12.362 STDOUT terraform: time_sleep.wait_for_arangodb_crd: Refreshing state... [id=2025-12-23T03:02:50Z]
19:42:12.369 STDOUT terraform: kubectl_manifest.arangodb_deployment: Refreshing state... [id=/apis/database.arangodb.com/v1/namespaces/data-prod/arangodeployments/arangodb]
19:42:12.695 STDOUT terraform: Terraform used the selected providers to generate the following execution
19:42:12.696 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
19:42:12.696 STDOUT terraform:   + create
19:42:12.696 STDOUT terraform:   ~ update in-place
19:42:12.696 STDOUT terraform: Terraform will perform the following actions:
19:42:12.696 STDOUT terraform:   # clickhousedbops_database.openpanel_events will be created
19:42:12.696 STDOUT terraform:   + resource "clickhousedbops_database" "openpanel_events" {
19:42:12.696 STDOUT terraform:       + name = "openpanel_events"
19:42:12.696 STDOUT terraform:       + uuid = (known after apply)
19:42:12.696 STDOUT terraform:     }
19:42:12.696 STDOUT terraform:   # clickhousedbops_database.signoz_logs will be created
19:42:12.696 STDOUT terraform:   + resource "clickhousedbops_database" "signoz_logs" {
19:42:12.696 STDOUT terraform:       + name = "signoz_logs"
19:42:12.696 STDOUT terraform:       + uuid = (known after apply)
19:42:12.696 STDOUT terraform:     }
19:42:12.696 STDOUT terraform:   # clickhousedbops_database.signoz_metrics will be created
19:42:12.696 STDOUT terraform:   + resource "clickhousedbops_database" "signoz_metrics" {
19:42:12.696 STDOUT terraform:       + name = "signoz_metrics"
19:42:12.696 STDOUT terraform:       + uuid = (known after apply)
19:42:12.696 STDOUT terraform:     }
19:42:12.696 STDOUT terraform:   # clickhousedbops_database.signoz_traces will be created
19:42:12.696 STDOUT terraform:   + resource "clickhousedbops_database" "signoz_traces" {
19:42:12.696 STDOUT terraform:       + name = "signoz_traces"
19:42:12.696 STDOUT terraform:       + uuid = (known after apply)
19:42:12.696 STDOUT terraform:     }
19:42:12.696 STDOUT terraform:   # clickhousedbops_user.openpanel will be created
19:42:12.697 STDOUT terraform:   + resource "clickhousedbops_user" "openpanel" {
19:42:12.697 STDOUT terraform:       + id                              = (known after apply)
19:42:12.697 STDOUT terraform:       + name                            = "openpanel"
19:42:12.697 STDOUT terraform:       + password_sha256_hash_wo         = (write-only attribute)
19:42:12.697 STDOUT terraform:       + password_sha256_hash_wo_version = 1
19:42:12.697 STDOUT terraform:     }
19:42:12.697 STDOUT terraform:   # clickhousedbops_user.signoz will be created
19:42:12.697 STDOUT terraform:   + resource "clickhousedbops_user" "signoz" {
19:42:12.697 STDOUT terraform:       + id                              = (known after apply)
19:42:12.697 STDOUT terraform:       + name                            = "signoz"
19:42:12.697 STDOUT terraform:       + password_sha256_hash_wo         = (write-only attribute)
19:42:12.697 STDOUT terraform:       + password_sha256_hash_wo_version = 1
19:42:12.697 STDOUT terraform:     }
19:42:12.697 STDOUT terraform:   # helm_release.clickhouse_operator will be created
19:42:12.697 STDOUT terraform:   + resource "helm_release" "clickhouse_operator" {
19:42:12.697 STDOUT terraform:       + atomic                     = false
19:42:12.697 STDOUT terraform:       + chart                      = "altinity-clickhouse-operator"
19:42:12.697 STDOUT terraform:       + cleanup_on_fail            = false
19:42:12.697 STDOUT terraform:       + create_namespace           = false
19:42:12.697 STDOUT terraform:       + dependency_update          = false
19:42:12.697 STDOUT terraform:       + disable_crd_hooks          = false
19:42:12.698 STDOUT terraform:       + disable_openapi_validation = false
19:42:12.698 STDOUT terraform:       + disable_webhooks           = false
19:42:12.698 STDOUT terraform:       + force_update               = false
19:42:12.698 STDOUT terraform:       + id                         = (known after apply)
19:42:12.698 STDOUT terraform:       + lint                       = false
19:42:12.698 STDOUT terraform:       + manifest                   = (known after apply)
19:42:12.698 STDOUT terraform:       + max_history                = 0
19:42:12.698 STDOUT terraform:       + metadata                   = (known after apply)
19:42:12.698 STDOUT terraform:       + name                       = "clickhouse-operator"
19:42:12.698 STDOUT terraform:       + namespace                  = "data-prod"
19:42:12.698 STDOUT terraform:       + pass_credentials           = false
19:42:12.698 STDOUT terraform:       + recreate_pods              = false
19:42:12.698 STDOUT terraform:       + render_subchart_notes      = true
19:42:12.698 STDOUT terraform:       + replace                    = false
19:42:12.698 STDOUT terraform:       + repository                 = "https://altinity.github.io/clickhouse-operator/"
19:42:12.698 STDOUT terraform:       + reset_values               = false
19:42:12.698 STDOUT terraform:       + reuse_values               = false
19:42:12.698 STDOUT terraform:       + skip_crds                  = false
19:42:12.698 STDOUT terraform:       + status                     = "deployed"
19:42:12.698 STDOUT terraform:       + timeout                    = 300
19:42:12.699 STDOUT terraform:       + verify                     = false
19:42:12.699 STDOUT terraform:       + version                    = "0.25.6"
19:42:12.699 STDOUT terraform:       + wait                       = true
19:42:12.699 STDOUT terraform:       + wait_for_jobs              = true
19:42:12.699 STDOUT terraform:     }
19:42:12.699 STDOUT terraform:   # helm_release.redis_operator will be created
19:42:12.699 STDOUT terraform:   + resource "helm_release" "redis_operator" {
19:42:12.699 STDOUT terraform:       + atomic                     = false
19:42:12.699 STDOUT terraform:       + chart                      = "redis-operator"
19:42:12.699 STDOUT terraform:       + cleanup_on_fail            = false
19:42:12.699 STDOUT terraform:       + create_namespace           = false
19:42:12.699 STDOUT terraform:       + dependency_update          = false
19:42:12.699 STDOUT terraform:       + disable_crd_hooks          = false
19:42:12.699 STDOUT terraform:       + disable_openapi_validation = false
19:42:12.699 STDOUT terraform:       + disable_webhooks           = false
19:42:12.699 STDOUT terraform:       + force_update               = false
19:42:12.699 STDOUT terraform:       + id                         = (known after apply)
19:42:12.699 STDOUT terraform:       + lint                       = false
19:42:12.699 STDOUT terraform:       + manifest                   = (known after apply)
19:42:12.699 STDOUT terraform:       + max_history                = 0
19:42:12.699 STDOUT terraform:       + metadata                   = (known after apply)
19:42:12.699 STDOUT terraform:       + name                       = "redis-operator"
19:42:12.699 STDOUT terraform:       + namespace                  = "data-prod"
19:42:12.700 STDOUT terraform:       + pass_credentials           = false
19:42:12.700 STDOUT terraform:       + recreate_pods              = false
19:42:12.700 STDOUT terraform:       + render_subchart_notes      = true
19:42:12.700 STDOUT terraform:       + replace                    = false
19:42:12.700 STDOUT terraform:       + repository                 = "https://ot-container-kit.github.io/helm-charts/"
19:42:12.700 STDOUT terraform:       + reset_values               = false
19:42:12.700 STDOUT terraform:       + reuse_values               = false
19:42:12.700 STDOUT terraform:       + skip_crds                  = false
19:42:12.700 STDOUT terraform:       + status                     = "deployed"
19:42:12.700 STDOUT terraform:       + timeout                    = 300
19:42:12.700 STDOUT terraform:       + verify                     = false
19:42:12.700 STDOUT terraform:       + version                    = "0.6.0"
19:42:12.700 STDOUT terraform:       + wait                       = true
19:42:12.700 STDOUT terraform:       + wait_for_jobs              = true
19:42:12.700 STDOUT terraform:     }
19:42:12.700 STDOUT terraform:   # kubectl_manifest.clickhouse_installation will be created
19:42:12.700 STDOUT terraform:   + resource "kubectl_manifest" "clickhouse_installation" {
19:42:12.700 STDOUT terraform:       + api_version             = "clickhouse.altinity.com/v1"
19:42:12.700 STDOUT terraform:       + apply_only              = false
19:42:12.700 STDOUT terraform:       + field_manager           = "kubectl"
19:42:12.701 STDOUT terraform:       + force_conflicts         = false
19:42:12.701 STDOUT terraform:       + force_new               = false
19:42:12.701 STDOUT terraform:       + id                      = (known after apply)
19:42:12.701 STDOUT terraform:       + kind                    = "ClickHouseInstallation"
19:42:12.701 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
19:42:12.701 STDOUT terraform:       + live_uid                = (known after apply)
19:42:12.701 STDOUT terraform:       + name                    = "clickhouse"
19:42:12.701 STDOUT terraform:       + namespace               = "data-prod"
19:42:12.701 STDOUT terraform:       + server_side_apply       = false
19:42:12.701 STDOUT terraform:       + uid                     = (known after apply)
19:42:12.701 STDOUT terraform:       + validate_schema         = true
19:42:12.701 STDOUT terraform:       + wait_for_rollout        = true
19:42:12.701 STDOUT terraform:       + yaml_body               = (sensitive value)
19:42:12.701 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
19:42:12.701 STDOUT terraform:             apiVersion: clickhouse.altinity.com/v1
19:42:12.701 STDOUT terraform:             kind: ClickHouseInstallation
19:42:12.701 STDOUT terraform:             metadata:
19:42:12.701 STDOUT terraform:               labels:
19:42:12.701 STDOUT terraform:                 env: prod
19:42:12.701 STDOUT terraform:                 module: data
19:42:12.701 STDOUT terraform:               name: clickhouse
19:42:12.701 STDOUT terraform:               namespace: data-prod
19:42:12.701 STDOUT terraform:             spec:
19:42:12.701 STDOUT terraform:               configuration:
19:42:12.701 STDOUT terraform:                 clusters:
19:42:12.701 STDOUT terraform:                 - layout:
19:42:12.701 STDOUT terraform:                     replicasCount: 1
19:42:12.701 STDOUT terraform:                     shardsCount: 1
19:42:12.701 STDOUT terraform:                   name: main
19:42:12.701 STDOUT terraform:                 users:
19:42:12.701 STDOUT terraform:                   default/networks/ip:
19:42:12.701 STDOUT terraform:                   - 0.0.0.0/0
19:42:12.701 STDOUT terraform:                   default/password: 6vnt8XQGdUVrMEiLLtgtrhyJEV754m0r
19:42:12.702 STDOUT terraform:                   default/password_sha256_hex: ba0137951758d5142fb160bc63a151c3a8ec813c7faa62a7dbe881a56734aaee
19:42:12.702 STDOUT terraform:               defaults:
19:42:12.702 STDOUT terraform:                 templates:
19:42:12.702 STDOUT terraform:                   podTemplate: clickhouse-pod
19:42:12.702 STDOUT terraform:                   serviceTemplate: clickhouse-service
19:42:12.702 STDOUT terraform:               templates:
19:42:12.702 STDOUT terraform:                 podTemplates:
19:42:12.702 STDOUT terraform:                 - name: clickhouse-pod
19:42:12.702 STDOUT terraform:                   spec:
19:42:12.702 STDOUT terraform:                     containers:
19:42:12.702 STDOUT terraform:                     - image: clickhouse/clickhouse-server:25.7.8
19:42:12.702 STDOUT terraform:                       imagePullPolicy: IfNotPresent
19:42:12.702 STDOUT terraform:                       name: clickhouse
19:42:12.702 STDOUT terraform:                       resources:
19:42:12.702 STDOUT terraform:                         limits:
19:42:12.702 STDOUT terraform:                           cpu: 1000m
19:42:12.702 STDOUT terraform:                           memory: 1Gi
19:42:12.702 STDOUT terraform:                         requests:
19:42:12.702 STDOUT terraform:                           cpu: 200m
19:42:12.702 STDOUT terraform:                           memory: 256Mi
19:42:12.702 STDOUT terraform:                       volumeMounts:
19:42:12.702 STDOUT terraform:                       - mountPath: /var/lib/clickhouse
19:42:12.702 STDOUT terraform:                         name: clickhouse-data
19:42:12.702 STDOUT terraform:                 serviceTemplates:
19:42:12.702 STDOUT terraform:                 - metadata:
19:42:12.702 STDOUT terraform:                     name: clickhouse
19:42:12.702 STDOUT terraform:                   name: clickhouse-service
19:42:12.702 STDOUT terraform:                   spec:
19:42:12.702 STDOUT terraform:                     ports:
19:42:12.702 STDOUT terraform:                     - name: http
19:42:12.702 STDOUT terraform:                       port: 8123
19:42:12.702 STDOUT terraform:                     - name: tcp
19:42:12.702 STDOUT terraform:                       port: 9000
19:42:12.702 STDOUT terraform:                     type: ClusterIP
19:42:12.702 STDOUT terraform:                 volumeClaimTemplates:
19:42:12.702 STDOUT terraform:                 - name: clickhouse-data
19:42:12.702 STDOUT terraform:                   spec:
19:42:12.702 STDOUT terraform:                     accessModes:
19:42:12.702 STDOUT terraform:                     - ReadWriteOnce
19:42:12.702 STDOUT terraform:                     resources:
19:42:12.702 STDOUT terraform:                       requests:
19:42:12.702 STDOUT terraform:                         storage: 10Gi
19:42:12.702 STDOUT terraform:                     storageClassName: local-path-retain
19:42:12.702 STDOUT terraform:         EOT
19:42:12.702 STDOUT terraform:       + yaml_incluster          = (sensitive value)
19:42:12.702 STDOUT terraform:     }
19:42:12.702 STDOUT terraform:   # kubectl_manifest.openpanel_postgres_init will be created
19:42:12.703 STDOUT terraform:   + resource "kubectl_manifest" "openpanel_postgres_init" {
19:42:12.703 STDOUT terraform:       + api_version             = "batch/v1"
19:42:12.703 STDOUT terraform:       + apply_only              = false
19:42:12.703 STDOUT terraform:       + field_manager           = "kubectl"
19:42:12.703 STDOUT terraform:       + force_conflicts         = false
19:42:12.703 STDOUT terraform:       + force_new               = false
19:42:12.703 STDOUT terraform:       + id                      = (known after apply)
19:42:12.703 STDOUT terraform:       + kind                    = "Job"
19:42:12.703 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
19:42:12.703 STDOUT terraform:       + live_uid                = (known after apply)
19:42:12.703 STDOUT terraform:       + name                    = "openpanel-postgres-init"
19:42:12.703 STDOUT terraform:       + namespace               = "data-prod"
19:42:12.703 STDOUT terraform:       + server_side_apply       = false
19:42:12.703 STDOUT terraform:       + uid                     = (known after apply)
19:42:12.703 STDOUT terraform:       + validate_schema         = true
19:42:12.703 STDOUT terraform:       + wait_for_rollout        = true
19:42:12.703 STDOUT terraform:       + yaml_body               = (sensitive value)
19:42:12.703 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
19:42:12.703 STDOUT terraform:             apiVersion: batch/v1
19:42:12.703 STDOUT terraform:             kind: Job
19:42:12.703 STDOUT terraform:             metadata:
19:42:12.703 STDOUT terraform:               labels:
19:42:12.703 STDOUT terraform:                 app: openpanel
19:42:12.703 STDOUT terraform:                 purpose: db-init
19:42:12.703 STDOUT terraform:               name: openpanel-postgres-init
19:42:12.703 STDOUT terraform:               namespace: data-prod
19:42:12.703 STDOUT terraform:             spec:
19:42:12.703 STDOUT terraform:               backoffLimit: 3
19:42:12.703 STDOUT terraform:               template:
19:42:12.703 STDOUT terraform:                 spec:
19:42:12.703 STDOUT terraform:                   containers:
19:42:12.703 STDOUT terraform:                   - args:
19:42:12.703 STDOUT terraform:                     - -c
19:42:12.704 STDOUT terraform:                     - |
19:42:12.704 STDOUT terraform:                       set -e
19:42:12.704 STDOUT terraform:                       echo "Waiting for PostgreSQL..."
19:42:12.704 STDOUT terraform:                       until pg_isready -h postgresql-rw -U postgres -t 5; do sleep 2; done
19:42:12.704 STDOUT terraform:             
19:42:12.704 STDOUT terraform:                       echo "Creating OpenPanel user..."
19:42:12.704 STDOUT terraform:                       psql -h postgresql-rw -U postgres -tc "SELECT 1 FROM pg_roles WHERE rolname='openpanel'" | grep -q 1 || \
19:42:12.704 STDOUT terraform:                         psql -h postgresql-rw -U postgres -c "CREATE USER openpanel WITH PASSWORD '$OPENPANEL_PASSWORD';"
19:42:12.704 STDOUT terraform:             
19:42:12.704 STDOUT terraform:                       echo "Creating OpenPanel database..."
19:42:12.704 STDOUT terraform:                       psql -h postgresql-rw -U postgres -tc "SELECT 1 FROM pg_database WHERE datname='openpanel'" | grep -q 1 || \
19:42:12.704 STDOUT terraform:                         psql -h postgresql-rw -U postgres -c "CREATE DATABASE openpanel OWNER openpanel;"
19:42:12.704 STDOUT terraform:             
19:42:12.704 STDOUT terraform:                       echo "OpenPanel PostgreSQL setup complete"
19:42:12.704 STDOUT terraform:                     command:
19:42:12.704 STDOUT terraform:                     - /bin/sh
19:42:12.704 STDOUT terraform:                     env:
19:42:12.704 STDOUT terraform:                     - name: PGPASSWORD
19:42:12.704 STDOUT terraform:                       valueFrom:
19:42:12.704 STDOUT terraform:                         secretKeyRef:
19:42:12.704 STDOUT terraform:                           key: password
19:42:12.704 STDOUT terraform:                           name: postgresql-credentials
19:42:12.704 STDOUT terraform:                     - name: OPENPANEL_PASSWORD
19:42:12.704 STDOUT terraform:                       value: FdxydwAOhPbBvygEMXHhf1R9
19:42:12.704 STDOUT terraform:                     image: postgres:16-alpine
19:42:12.704 STDOUT terraform:                     name: psql-init
19:42:12.704 STDOUT terraform:                   restartPolicy: OnFailure
19:42:12.705 STDOUT terraform:               ttlSecondsAfterFinished: 86400
19:42:12.705 STDOUT terraform:         EOT
19:42:12.705 STDOUT terraform:       + yaml_incluster          = (sensitive value)
19:42:12.705 STDOUT terraform:     }
19:42:12.705 STDOUT terraform:   # kubectl_manifest.postgresql_cluster will be created
19:42:12.705 STDOUT terraform:   + resource "kubectl_manifest" "postgresql_cluster" {
19:42:12.705 STDOUT terraform:       + api_version             = "postgresql.cnpg.io/v1"
19:42:12.705 STDOUT terraform:       + apply_only              = false
19:42:12.705 STDOUT terraform:       + field_manager           = "kubectl"
19:42:12.705 STDOUT terraform:       + force_conflicts         = false
19:42:12.705 STDOUT terraform:       + force_new               = false
19:42:12.705 STDOUT terraform:       + id                      = (known after apply)
19:42:12.705 STDOUT terraform:       + kind                    = "Cluster"
19:42:12.705 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
19:42:12.705 STDOUT terraform:       + live_uid                = (known after apply)
19:42:12.705 STDOUT terraform:       + name                    = "postgresql"
19:42:12.705 STDOUT terraform:       + namespace               = "data-prod"
19:42:12.705 STDOUT terraform:       + server_side_apply       = false
19:42:12.705 STDOUT terraform:       + uid                     = (known after apply)
19:42:12.705 STDOUT terraform:       + validate_schema         = true
19:42:12.705 STDOUT terraform:       + wait_for_rollout        = true
19:42:12.705 STDOUT terraform:       + yaml_body               = (sensitive value)
19:42:12.705 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
19:42:12.705 STDOUT terraform:             apiVersion: postgresql.cnpg.io/v1
19:42:12.705 STDOUT terraform:             kind: Cluster
19:42:12.705 STDOUT terraform:             metadata:
19:42:12.705 STDOUT terraform:               labels:
19:42:12.705 STDOUT terraform:                 env: prod
19:42:12.705 STDOUT terraform:                 module: data
19:42:12.705 STDOUT terraform:               name: postgresql
19:42:12.705 STDOUT terraform:               namespace: data-prod
19:42:12.706 STDOUT terraform:             spec:
19:42:12.706 STDOUT terraform:               bootstrap:
19:42:12.706 STDOUT terraform:                 initdb:
19:42:12.706 STDOUT terraform:                   database: app
19:42:12.706 STDOUT terraform:                   owner: postgres
19:42:12.706 STDOUT terraform:               instances: 1
19:42:12.706 STDOUT terraform:               monitoring:
19:42:12.706 STDOUT terraform:                 enablePodMonitor: false
19:42:12.706 STDOUT terraform:               postgresql:
19:42:12.706 STDOUT terraform:                 parameters:
19:42:12.706 STDOUT terraform:                   checkpoint_timeout: 15min
19:42:12.706 STDOUT terraform:                   effective_cache_size: 256MB
19:42:12.706 STDOUT terraform:                   maintenance_work_mem: 64MB
19:42:12.706 STDOUT terraform:                   max_connections: "100"
19:42:12.706 STDOUT terraform:                   max_replication_slots: "3"
19:42:12.706 STDOUT terraform:                   max_wal_senders: "3"
19:42:12.706 STDOUT terraform:                   shared_buffers: 128MB
19:42:12.706 STDOUT terraform:                   wal_level: replica
19:42:12.706 STDOUT terraform:               resources:
19:42:12.706 STDOUT terraform:                 limits:
19:42:12.706 STDOUT terraform:                   cpu: 500m
19:42:12.706 STDOUT terraform:                   memory: 512Mi
19:42:12.706 STDOUT terraform:                 requests:
19:42:12.706 STDOUT terraform:                   cpu: 100m
19:42:12.706 STDOUT terraform:                   memory: 128Mi
19:42:12.706 STDOUT terraform:               storage:
19:42:12.706 STDOUT terraform:                 size: 10Gi
19:42:12.706 STDOUT terraform:                 storageClass: local-path-retain
19:42:12.706 STDOUT terraform:               superuserSecret:
19:42:12.706 STDOUT terraform:                 name: postgresql-credentials
19:42:12.706 STDOUT terraform:         EOT
19:42:12.706 STDOUT terraform:       + yaml_incluster          = (sensitive value)
19:42:12.706 STDOUT terraform:     }
19:42:12.706 STDOUT terraform:   # kubectl_manifest.redis will be created
19:42:12.706 STDOUT terraform:   + resource "kubectl_manifest" "redis" {
19:42:12.706 STDOUT terraform:       + api_version             = "redis.redis.opstreelabs.in/v1beta2"
19:42:12.706 STDOUT terraform:       + apply_only              = false
19:42:12.706 STDOUT terraform:       + field_manager           = "kubectl"
19:42:12.707 STDOUT terraform:       + force_conflicts         = false
19:42:12.707 STDOUT terraform:       + force_new               = false
19:42:12.707 STDOUT terraform:       + id                      = (known after apply)
19:42:12.707 STDOUT terraform:       + kind                    = "Redis"
19:42:12.707 STDOUT terraform:       + live_manifest_incluster = (sensitive value)
19:42:12.707 STDOUT terraform:       + live_uid                = (known after apply)
19:42:12.707 STDOUT terraform:       + name                    = "redis-master"
19:42:12.707 STDOUT terraform:       + namespace               = "data-prod"
19:42:12.707 STDOUT terraform:       + server_side_apply       = false
19:42:12.707 STDOUT terraform:       + uid                     = (known after apply)
19:42:12.707 STDOUT terraform:       + validate_schema         = true
19:42:12.707 STDOUT terraform:       + wait_for_rollout        = true
19:42:12.707 STDOUT terraform:       + yaml_body               = (sensitive value)
19:42:12.707 STDOUT terraform:       + yaml_body_parsed        = <<-EOT
19:42:12.707 STDOUT terraform:             apiVersion: redis.redis.opstreelabs.in/v1beta2
19:42:12.707 STDOUT terraform:             kind: Redis
19:42:12.707 STDOUT terraform:             metadata:
19:42:12.707 STDOUT terraform:               labels:
19:42:12.707 STDOUT terraform:                 env: prod
19:42:12.707 STDOUT terraform:                 module: data
19:42:12.707 STDOUT terraform:               name: redis-master
19:42:12.707 STDOUT terraform:               namespace: data-prod
19:42:12.707 STDOUT terraform:             spec:
19:42:12.707 STDOUT terraform:               kubernetesConfig:
19:42:12.707 STDOUT terraform:                 image: quay.io/opstree/redis:v7.0.15
19:42:12.707 STDOUT terraform:                 imagePullPolicy: IfNotPresent
19:42:12.707 STDOUT terraform:                 redisSecret:
19:42:12.707 STDOUT terraform:                   key: password
19:42:12.707 STDOUT terraform:                   name: redis-credentials
19:42:12.707 STDOUT terraform:                 resources:
19:42:12.707 STDOUT terraform:                   limits:
19:42:12.707 STDOUT terraform:                     cpu: 200m
19:42:12.707 STDOUT terraform:                     memory: 256Mi
19:42:12.707 STDOUT terraform:                   requests:
19:42:12.708 STDOUT terraform:                     cpu: 50m
19:42:12.708 STDOUT terraform:                     memory: 64Mi
19:42:12.708 STDOUT terraform:                 service:
19:42:12.708 STDOUT terraform:                   additional:
19:42:12.708 STDOUT terraform:                     enabled: false
19:42:12.708 STDOUT terraform:               redisConfig:
19:42:12.708 STDOUT terraform:                 additionalRedisConfig: |
19:42:12.708 STDOUT terraform:                   appendonly yes
19:42:12.708 STDOUT terraform:                   appendfsync everysec
19:42:12.708 STDOUT terraform:                   save 900 1
19:42:12.708 STDOUT terraform:                   save 300 10
19:42:12.708 STDOUT terraform:                   save 60 10000
19:42:12.708 STDOUT terraform:               storage:
19:42:12.708 STDOUT terraform:                 keepAfterDelete: true
19:42:12.708 STDOUT terraform:                 volumeClaimTemplate:
19:42:12.708 STDOUT terraform:                   spec:
19:42:12.708 STDOUT terraform:                     accessModes:
19:42:12.708 STDOUT terraform:                     - ReadWriteOnce
19:42:12.708 STDOUT terraform:                     resources:
19:42:12.708 STDOUT terraform:                       requests:
19:42:12.708 STDOUT terraform:                         storage: 2Gi
19:42:12.708 STDOUT terraform:                     storageClassName: local-path-retain
19:42:12.708 STDOUT terraform:         EOT
19:42:12.708 STDOUT terraform:       + yaml_incluster          = (sensitive value)
19:42:12.708 STDOUT terraform:     }
19:42:12.708 STDOUT terraform:   # kubernetes_namespace.data will be updated in-place
19:42:12.708 STDOUT terraform:   ~ resource "kubernetes_namespace" "data" {
19:42:12.708 STDOUT terraform:         id                               = "data-prod"
19:42:12.708 STDOUT terraform:       + wait_for_default_service_account = false
19:42:12.708 STDOUT terraform:       ~ metadata {
19:42:12.708 STDOUT terraform:           ~ labels           = {
19:42:12.708 STDOUT terraform:               - "layer"  = "L3" -> null
19:42:12.708 STDOUT terraform:               + "module" = "data"
19:42:12.708 STDOUT terraform:                 # (1 unchanged element hidden)
19:42:12.708 STDOUT terraform:             }
19:42:12.708 STDOUT terraform:             name             = "data-prod"
19:42:12.709 STDOUT terraform:             # (5 unchanged attributes hidden)
19:42:12.709 STDOUT terraform:         }
19:42:12.709 STDOUT terraform:     }
19:42:12.709 STDOUT terraform:   # time_sleep.wait_for_clickhouse_crd will be created
19:42:12.709 STDOUT terraform:   + resource "time_sleep" "wait_for_clickhouse_crd" {
19:42:12.709 STDOUT terraform:       + create_duration = "30s"
19:42:12.709 STDOUT terraform:       + id              = (known after apply)
19:42:12.709 STDOUT terraform:     }
19:42:12.709 STDOUT terraform:   # time_sleep.wait_for_postgresql_cluster will be created
19:42:12.709 STDOUT terraform:   + resource "time_sleep" "wait_for_postgresql_cluster" {
19:42:12.709 STDOUT terraform:       + create_duration = "60s"
19:42:12.709 STDOUT terraform:       + id              = (known after apply)
19:42:12.709 STDOUT terraform:     }
19:42:12.709 STDOUT terraform:   # time_sleep.wait_for_redis_crd will be created
19:42:12.709 STDOUT terraform:   + resource "time_sleep" "wait_for_redis_crd" {
19:42:12.709 STDOUT terraform:       + create_duration = "30s"
19:42:12.709 STDOUT terraform:       + id              = (known after apply)
19:42:12.709 STDOUT terraform:     }
19:42:12.709 STDOUT terraform:   # vault_database_secret_backend_connection.postgres will be created
19:42:12.709 STDOUT terraform:   + resource "vault_database_secret_backend_connection" "postgres" {
19:42:12.709 STDOUT terraform:       + allowed_roles     = [
19:42:12.709 STDOUT terraform:           + "postgres-readonly",
19:42:12.709 STDOUT terraform:           + "postgres-readwrite",
19:42:12.709 STDOUT terraform:         ]
19:42:12.709 STDOUT terraform:       + backend           = "database"
19:42:12.709 STDOUT terraform:       + id                = (known after apply)
19:42:12.709 STDOUT terraform:       + name              = "postgres"
19:42:12.709 STDOUT terraform:       + plugin_name       = (known after apply)
19:42:12.709 STDOUT terraform:       + verify_connection = true
19:42:12.709 STDOUT terraform:       + postgresql {
19:42:12.709 STDOUT terraform:           + connection_url          = (sensitive value)
19:42:12.709 STDOUT terraform:           + max_open_connections    = 2
19:42:12.709 STDOUT terraform:           + password_authentication = "password"
19:42:12.709 STDOUT terraform:         }
19:42:12.710 STDOUT terraform:     }
19:42:12.710 STDOUT terraform:   # vault_database_secret_backend_role.postgres_readonly will be created
19:42:12.710 STDOUT terraform:   + resource "vault_database_secret_backend_role" "postgres_readonly" {
19:42:12.710 STDOUT terraform:       + backend               = "database"
19:42:12.710 STDOUT terraform:       + creation_statements   = [
19:42:12.710 STDOUT terraform:           + "CREATE ROLE \"{{name}}\" WITH LOGIN PASSWORD '{{password}}' VALID UNTIL '{{expiration}}';",
19:42:12.710 STDOUT terraform:           + "GRANT SELECT ON ALL TABLES IN SCHEMA public TO \"{{name}}\";",
19:42:12.710 STDOUT terraform:           + "GRANT USAGE ON SCHEMA public TO \"{{name}}\";",
19:42:12.710 STDOUT terraform:         ]
19:42:12.710 STDOUT terraform:       + credential_type       = (known after apply)
19:42:12.710 STDOUT terraform:       + db_name               = "postgres"
19:42:12.710 STDOUT terraform:       + default_ttl           = 3600
19:42:12.710 STDOUT terraform:       + id                    = (known after apply)
19:42:12.710 STDOUT terraform:       + max_ttl               = 86400
19:42:12.710 STDOUT terraform:       + name                  = "postgres-readonly"
19:42:12.710 STDOUT terraform:       + revocation_statements = [
19:42:12.710 STDOUT terraform:           + "REVOKE ALL PRIVILEGES ON ALL TABLES IN SCHEMA public FROM \"{{name}}\";",
19:42:12.710 STDOUT terraform:           + "DROP ROLE IF EXISTS \"{{name}}\";",
19:42:12.710 STDOUT terraform:         ]
19:42:12.710 STDOUT terraform:     }
19:42:12.710 STDOUT terraform:   # vault_database_secret_backend_role.postgres_readwrite will be created
19:42:12.710 STDOUT terraform:   + resource "vault_database_secret_backend_role" "postgres_readwrite" {
19:42:12.710 STDOUT terraform:       + backend               = "database"
19:42:12.710 STDOUT terraform:       + creation_statements   = [
19:42:12.710 STDOUT terraform:           + "CREATE ROLE \"{{name}}\" WITH LOGIN PASSWORD '{{password}}' VALID UNTIL '{{expiration}}';",
19:42:12.710 STDOUT terraform:           + "GRANT SELECT, INSERT, UPDATE, DELETE ON ALL TABLES IN SCHEMA public TO \"{{name}}\";",
19:42:12.711 STDOUT terraform:           + "GRANT USAGE, SELECT ON ALL SEQUENCES IN SCHEMA public TO \"{{name}}\";",
19:42:12.711 STDOUT terraform:           + "GRANT USAGE ON SCHEMA public TO \"{{name}}\";",
19:42:12.711 STDOUT terraform:         ]
19:42:12.711 STDOUT terraform:       + credential_type       = (known after apply)
19:42:12.711 STDOUT terraform:       + db_name               = "postgres"
19:42:12.711 STDOUT terraform:       + default_ttl           = 3600
19:42:12.711 STDOUT terraform:       + id                    = (known after apply)
19:42:12.711 STDOUT terraform:       + max_ttl               = 86400
19:42:12.711 STDOUT terraform:       + name                  = "postgres-readwrite"
19:42:12.711 STDOUT terraform:       + revocation_statements = [
19:42:12.711 STDOUT terraform:           + "REVOKE ALL PRIVILEGES ON ALL TABLES IN SCHEMA public FROM \"{{name}}\";",
19:42:12.711 STDOUT terraform:           + "REVOKE ALL PRIVILEGES ON ALL SEQUENCES IN SCHEMA public FROM \"{{name}}\";",
19:42:12.711 STDOUT terraform:           + "DROP ROLE IF EXISTS \"{{name}}\";",
19:42:12.711 STDOUT terraform:         ]
19:42:12.711 STDOUT terraform:     }
19:42:12.711 STDOUT terraform:   # vault_kv_secret_v2.signoz will be updated in-place
19:42:12.711 STDOUT terraform:   ~ resource "vault_kv_secret_v2" "signoz" {
19:42:12.711 STDOUT terraform:       ~ data_json           = (sensitive value)
19:42:12.711 STDOUT terraform:         id                  = "secret/data/signoz"
19:42:12.711 STDOUT terraform:         name                = "signoz"
19:42:12.711 STDOUT terraform:         # (6 unchanged attributes hidden)
19:42:12.711 STDOUT terraform:         # (1 unchanged block hidden)
19:42:12.711 STDOUT terraform:     }
19:42:12.711 STDOUT terraform: Plan: 18 to add, 2 to change, 0 to destroy.
19:42:12.711 STDOUT terraform: Changes to Outputs:
19:42:12.711 STDOUT terraform:   + data_health_status            = {
19:42:12.711 STDOUT terraform:       + arangodb   = "deployed"
19:42:12.711 STDOUT terraform:       + clickhouse = "deployed"
19:42:12.711 STDOUT terraform:       + postgres   = "cnpg-cluster"
19:42:12.711 STDOUT terraform:       + redis      = "deployed"
19:42:12.711 STDOUT terraform:     }
19:42:12.711 STDOUT terraform:   + data_namespace                = "data-prod"
19:42:12.711 STDOUT terraform:   - l3_health_status              = {
19:42:12.711 STDOUT terraform:       - arangodb   = "deployed"
19:42:12.711 STDOUT terraform:       - clickhouse = "deployed"
19:42:12.711 STDOUT terraform:       - postgres   = "deployed"
19:42:12.711 STDOUT terraform:       - redis      = "deployed"
19:42:12.712 STDOUT terraform:     } -> null
19:42:12.712 STDOUT terraform:   - l3_namespace                  = "data-prod" -> null
19:42:12.712 STDOUT terraform:   ~ postgres_host                 = "postgresql.data-prod.svc.cluster.local" -> "postgresql-rw.data-prod.svc.cluster.local"
19:42:12.712 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
19:42:12.712 STDOUT terraform: Saved the plan to: tfplan
19:42:12.712 STDOUT terraform: To perform exactly these actions, run the following command to apply:
19:42:12.712 STDOUT terraform:     terraform apply "tfplan"
```

</details>
